Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/main.c
  return k_rx_ok;
}

/**
 * @brief ThreadX application definition callback - Create application threads and kernel objects
 *
 * @details
 * This function is **called by the ThreadX kernel** immediately after `tx_kernel_enter()`.
 * It provides the application with an entry point to create threads, semaphores, message queues,
 * mutexes, and other RTOS kernel objects.
 *
 * **ThreadX startup sequence:**
 * ```
 * main() -> tx_kernel_enter() -> [ThreadX internal init] -> tx_application_define() -> [scheduler start]
 * ```
 *
 * ## Application Thread Creation
 *
 * This callback creates the **main application task** (`app_main_task`) which runs the
 * motor control PID loop at 100 Hz and handles USB communication.
 *
 * **Thread hierarchy:**
 * @dot
 * digraph threads {
 *   rankdir=TB;
 *   node [shape=box];
 *
 *   ThreadX [label="ThreadX Kernel", shape=ellipse];
 *   AppDef [label="tx_application_define()"];
 *   MainTask [label="app_main_task\n(Priority 5, 8KB stack)"];
 *   PID [label="PID Control Loop\n100 Hz"];
 *   USB [label="USB CDC\nCommunication"];
 *
 *   ThreadX -> AppDef [label="Callback"];
 *   AppDef -> MainTask [label="app_main_task_create()"];
 *   MainTask -> PID;
 *   MainTask -> USB;
 * }
 * @enddot
 *
 * ## Memory Management
 *
 * **first_unused_memory parameter:**
 * - Points to the first byte of unused SRAM after ThreadX kernel allocation
 * - Used for dynamically creating kernel objects (NOT used in STAR firmware)
 * - STAR uses **static allocation only** (stacks defined at compile-time)
 *
 * **Memory layout after ThreadX init:**
 * | Region | Size | Purpose |
 * |--------|------|---------|
 * | **BSS/Data** | ~10 KB | Global variables, ThreadX kernel data |
 * | **ThreadX heap** | 0 bytes | **Not used** (zero dynamic allocation policy) |
 * | **App main task stack** | 8 KB | Static allocation via tx_byte_pool or array |
 * | **first_unused_memory** | ~490 KB | Remaining free SRAM (unused) |
 *
 * ## Thread Creation Timing (RX72N @ 240 MHz)
 *
 * | Operation | Duration | Notes |
 * |-----------|----------|-------|
 * | tx_application_define() call | ~5 µs | ThreadX callback overhead |
 * | app_main_task_create() | ~20 µs | TCB init, stack setup |
 * | **Total** | **~25 µs** | Fast thread creation |
 *
 * ## Error Handling
 *
 * **Critical assertion:** Thread creation MUST succeed. Failure indicates:
 * - Memory exhaustion (insufficient SRAM for stack)
 * - Invalid thread parameters (priority, stack size)
 * - ThreadX internal error (corruption)
 *
 * **Recovery:** Assert-halt on failure (no recovery possible - critical error)
 *
 * @param[in] first_unused_memory Pointer to first unused SRAM byte after ThreadX kernel allocation
 *                                (Unused in STAR firmware - static allocation only)
 *
 * @return void (No return value - ThreadX callback convention)
 *
 * @pre ThreadX kernel initialized (tx_kernel_enter() called from main())
 * @pre SRAM available for thread stacks (minimum 8 KB for app_main_task)
 * @pre first_unused_memory points to valid SRAM address
 *
 * @post app_main_task created and ready to run (not yet started - scheduler starts after return)
 * @post Thread stack allocated and initialized (SP set to stack top)
 * @post Thread priority configured (priority 5 for main task)
 *
 * @note **This function executes BEFORE the ThreadX scheduler starts.** Threads created here
 *       are in READY state but do not execute until this function returns.
 *
 * @note **No blocking calls allowed** in this function (no tx_thread_sleep, tx_semaphore_get, etc.)
 *       as the scheduler is not yet running.
 *
 * @warning **Never return error from this function.** ThreadX callback convention requires void return.
 *          Use RX_ASSERT to halt on critical failures instead.
 *
 * @par Thread Safety:
 * Executes in single-threaded context (scheduler not started yet). No synchronization needed.
 *
 * @par Example Usage (Internal ThreadX Call):
 * @code
 * // ThreadX kernel calls this after tx_kernel_enter():
 * void tx_kernel_enter(void) {
 *   // ... ThreadX internal initialization ...
 *
 *   // Call application-defined callback
 *   tx_application_define(first_unused_memory);
 *
 *   // Start scheduler (threads begin executing)
 *   _tx_thread_schedule();
 * }
 * @endcode
 *
 * @par Example Thread Creation:
 * @code
 * void tx_application_define(void* first_unused_memory) {
 *   rx_err_t err;
 *
 *   // Validate parameter (ThreadX should always provide valid pointer)
 *   RX_ASSERT(first_unused_memory != nullptr, "first_unused_memory must be valid");
 *
 *   // Create main application task (8 KB stack, priority 5)
 *   err = app_main_task_create();
 *   RX_ERROR_CHECK(err);
 *
 *   // Assert thread creation succeeded (critical error if not)
 *   RX_ASSERT(err == k_rx_ok, "app_main_task_create must succeed");
 *
 *   // Return to ThreadX - scheduler will start after this function completes
 * }
 * @endcode
 *
 * @see app_main_task_create() Create main application thread (PID control, USB communication)
 * @see tx_kernel_enter() Start ThreadX scheduler (calls this callback internally)
 * @see app_main_task.c Implementation of main control loop (100 Hz PID)
 *
 * @since Version 1.0.0
 *
 * @test test_main.c Verify thread creation and scheduler startup
 */
void tx_application_define(void* first_unused_memory)
{
  rx_err_t err;

  /* Precondition: first_unused_memory parameter is provided by ThreadX */
  RX_ASSERT(first_unused_memory != nullptr, "Precondition: first_unused_memory must be valid");

  /* =========================================================================
   * Multi-Task Architecture Initialization
   *
   * Task creation order: lowest priority first to ensure higher priority
   * tasks can preempt during initialization if needed.
   *
   * Priority Map (lower = higher priority):
   *   5  = Communication (highest - command latency)
   *   8  = Motor Control (250 Hz control loop)
   *   12 = Obstacle Detection (safety-critical)
   *   15 = BMS Monitoring (1 Hz)
   *   15 = Temperature Sensing (1 Hz)
   *   17 = LED Status (20 Hz, visual feedback)
   *   18 = Telemetry Aggregation (20 Hz, lowest)
   * =========================================================================
   */

  /* Step 1a: Initialize bus manager (requires ThreadX mutex, so must be here) */
  {
    extern rx_bus_manager_t g_bus_manager;
    rx_error_interface_t*   error_iface = rx_infrastructure_get_error_interface();
    rx_pin_interface_t*     pin_iface   = rx_infrastructure_get_pin_interface();
    err = rx_bus_manager_init(&g_bus_manager, "BUS_MGR", error_iface, pin_iface);
    RX_ASSERT(err == k_rx_ok, "rx_bus_manager_init must succeed");
  }

  /* Step 1b: Initialize shared data module (mutexes, event flags) */
  err = shared_data_init();
  RX_ASSERT(err == k_rx_ok, "shared_data_init must succeed");

  /* Step 2: Create tasks (lowest priority first) */

  /* Telemetry Task - Priority 18 (lowest) */
  err = telemetry_task_create();
  RX_ASSERT(err == k_rx_ok, "telemetry_task_create must succeed");

